Beyzaydinn/LifeLine/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# === Two-plane I/O architecture ===
# DATA plane:   UART0 (GPIO 43 TX / 44 RX, 921 600 baud) -> CP210x USB-UART
#               bridge -> PC as COM port (e.g. COM12). Carries ONLY framed
#               binary protocol bytes (AES-encrypted audio/sensor/control).
#               No console attached, no log spew -- parser sees pristine
#               protocol stream.
#
# LOG plane:    USB-Serial-JTAG endpoint on the ESP32-S3 native USB
#               connector (GPIO 19/20). Exposes ESP_LOGx output and panic
#               traces over a second, independent COM port (e.g. COM13).
#               Used live with `idf.py -p COMxx monitor`.
#
# The two planes share no wire and no driver, so log traffic cannot
# corrupt the binary stream and the GUI on COM12 cannot disturb the log
# stream on COM13. Both USB cables can be plugged in simultaneously
# during development; for a "data-only" deployment, only the CP210x cable
# is required (log endpoint just goes unenumerated, app continues fine).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# AES hardware acceleration (course instructor requirement)
CONFIG_MBEDTLS_HARDWARE_AES=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
